taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32L4xx_DFP</name>
  <description>STMicroelectronics STM32L4 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="1.4.0" date="2017-02-24">
      Added basic device support for subfamilies STM32L4A6 and STM32L496
      Updated device support files to version V1.2.0 (except subfamilies STM32L4A6, STM32L496)
      Added QUADSPI peripheral to STM32L4x2.svd, STM32L4x3.svd
    </release>
    <release version="1.3.0" date="2016-11-14">
      Added device support for subfamilies STM32L462 STM32L452, STM32L451
      Updated documentation.
    </release>
    <release version="1.2.0" date="2016-03-03">
      Added device support for subfamilies STM32L431, STM32L432, STM32L433, STM32L443
      Updated documentation.
    </release>
    <release version="1.1.0" date="2016-02-19">
      Updated device support files and documentation
    </release>
    <release version="1.0.0" date="2015-07-28">
      Initial version of STM32L4 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32L4</keyword>
    <keyword>STM32L4xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32L4 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dclock="80000000" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
ST has built a new architecture to reach best-in-class ultra-low-power figures thanks to its high flexibility.
STM32L4 MCUs have scored 176.7 in the standardized EEMBC ULPBench tests that compare the efficiency of ultra-low-power microcontrollers.
Moreover, the STM32L4 series shatters performance limits in the ultra-low-power world.
It delivers 100 DMIPS based on its ARM Cortex-M4 core with FPU and ST ART Accelerator at 80 MHz.

STM32L4 microcontrollers offer dynamic voltage scaling to balance power consumption with processing demand, low-power peripherals (LP UART, LP timers) available in Stop mode, safety and security features, smart and numerous peripherals, advanced and low-power analog peripherals such as op amps, comparators, LCD, 12-bit DACs and 16-bit ADCs (hardware oversampling).
      </description>

      <environment name="uv">
        <LMisc>--branchpatch=sdcomp-29491-629360</LMisc>
      </environment>

      <!-- device features -->
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="I2S"           n="2"/>
      <feature type="Temp"          n="-40"     m="85"/>

      <!-- ************************  Subfamily 'STM32L431'  **************************** -->
      <subFamily DsubFamily="STM32L431">
        <debug svd="SVD/STM32L4x1.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L431xx"/>

        <book name="Documents/DM00151940.pdf" title="STM32L431xx STM32L433xx STM32L443xx Reference Manual"/>
        <book name="Documents/DM00257211.pdf" title="STM32L431xx Data Sheet"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="1"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- *************************  Device 'STM32L431CC'  ***************************** -->
        <device Dname="STM32L431CC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L431CCTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L431CCUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L431CCYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L431KC'  ***************************** -->
        <device Dname="STM32L431KC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L431KCUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L431RC'  ***************************** -->
        <device Dname="STM32L431RC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L431RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L431RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L431RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

