taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L431VC'  ***************************** -->
        <device Dname="STM32L431VC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L431VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L431VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L431CB'  ***************************** -->
        <device Dname="STM32L431CB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L431CBTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L431CBUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L431CBYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L431KB'  ***************************** -->
        <device Dname="STM32L431KB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L431KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L431RB'  ***************************** -->
        <device Dname="STM32L431RB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L431RBTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L431RBYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L431RBIx"> <feature type="BGA" n="64"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L432'  **************************** -->
      <subFamily DsubFamily="STM32L432">
        <debug svd="SVD/STM32L4x2.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L432xx"/>

        <book name="Documents/DM00151935.pdf" title="STM32L4x2 Reference Manual"/>
        <book name="Documents/DM00257205.pdf" title="STM32L432KB STM3L432KC Data Sheet"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="2"/>
        <feature type="ComOther" n="1"                  name="SAI Interface"/>
        <feature type="I2C"      n="2"/>
        <feature type="USART"    n="3"    m="11250000"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- *************************  Device 'STM32L432KC'  ***************************** -->
        <device Dname="STM32L432KC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L432KCUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L432KB'  ***************************** -->
        <device Dname="STM32L432KB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L432KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L433'  **************************** -->
      <subFamily DsubFamily="STM32L433">
        <debug svd="SVD/STM32L4x3.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L433xx"/>

        <book name="Documents/DM00151940.pdf" title="STM32L431xx STM32L433xx STM32L443xx Reference Manual"/>
        <book name="Documents/DM00257192.pdf" title="STM32L433xx Data Sheet"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- *************************  Device 'STM32L433CC'  ***************************** -->
        <device Dname="STM32L433CC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

