taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
          <variant Dvariant="STM32L433CCTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L433CCUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L433CCYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L433RC'  ***************************** -->
        <device Dname="STM32L433RC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L433RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L433RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L433RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L433VC'  ***************************** -->
        <device Dname="STM32L433VC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L433VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L433VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L433CB'  ***************************** -->
        <device Dname="STM32L433CB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L433CBTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L433CBUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L433CBYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L433RB'  ***************************** -->
        <device Dname="STM32L433RB">
          <memory id="IROM1"                        start="0x08000000" size="0x00020000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00020000"             default="1" />

          <variant Dvariant="STM32L433RBTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L433RBYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L433RBIx"> <feature type="BGA" n="64"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L443'  **************************** -->
      <subFamily DsubFamily="STM32L443">
        <debug svd="SVD/STM32L4x3.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L443xx"/>

        <book name="Documents/DM00151940.pdf" title="STM32L431xx STM32L433xx STM32L443xx Reference Manual"/>
        <book name="Documents/DM00254865.pdf" title="STM32L443xx Data Sheet"/>

        <feature type="Timer"    n="10"   m="16"/>
        <feature type="Timer"    n="1"    m="32"/>
        <feature type="ADC"      n="1"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="4"    m="11250000"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.71" m="3.60"/>

        <!-- *************************  Device 'STM32L443CC'  ***************************** -->
        <device Dname="STM32L443CC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L443CCTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L443CCUx"> <feature type="QFN" n="48"/> </variant>
          <variant Dvariant="STM32L443CCYx"> <feature type="CSP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L443RC'  ***************************** -->
        <device Dname="STM32L443RC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L443RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L443RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L443RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L443VC'  ***************************** -->
        <device Dname="STM32L443VC">
          <memory id="IROM1"                        start="0x08000000" size="0x00040000" startup="1" default="1" />
          <memory id="IRAM1"                        start="0x20000000" size="0x00010000" init="0"    default="1" />
          <algorithm name="Flash/STM32L4xx_256.FLM" start="0x08000000" size="0x00040000"             default="1" />

          <variant Dvariant="STM32L443VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L443VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L471'  **************************** -->
      <subFamily DsubFamily="STM32L471">
        <debug svd="SVD/STM32L4x1.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L471xx"/>

        <book name="Documents/DM00149427.pdf" title="STM32L4x1 Reference Manual"/>
        <book name="Documents/DM00149404.pdf" title="STM32L471xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="2"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                   name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="2"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

