taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L471VG'  ***************************** -->
        <device Dname="STM32L471VG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L471VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L471QG'  ***************************** -->
        <device Dname="STM32L471QG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L471QGIx"> <feature type="BGA" n="132"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L471ZG'  ***************************** -->
        <device Dname="STM32L471ZG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L471ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L475'  **************************** -->
      <subFamily DsubFamily="STM32L475">
        <debug svd="SVD/STM32L4x5.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L475xx"/>

        <book name="Documents/DM00151945.pdf" title="STM32L4x5 Reference Manual"/>
        <book name="Documents/DM00172872.pdf" title="STM32L475xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="2"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"               name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="2"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- *************************  Device 'STM32L475RC'  ***************************** -->
        <device Dname="STM32L475RC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L475RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475VC'  ***************************** -->
        <device Dname="STM32L475VC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L475VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475RE'  ***************************** -->
        <device Dname="STM32L475RE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L475RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475JE'  ***************************** -->
        <device Dname="STM32L475JE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L475JEYx"> <feature type="CSP" n="72"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475VE'  ***************************** -->
        <device Dname="STM32L475VE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

