taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
          <variant Dvariant="STM32L475VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475QE'  ***************************** -->
        <device Dname="STM32L475QE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L475QEIx"> <feature type="BGA" n="132"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475ZE'  ***************************** -->
        <device Dname="STM32L475ZE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L475ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475RG'  ***************************** -->
        <device Dname="STM32L475RG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L475RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475JG'  ***************************** -->
        <device Dname="STM32L475JG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L475JGYx"> <feature type="CSP" n="72"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475VG'  ***************************** -->
        <device Dname="STM32L475VG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L475VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475QG'  ***************************** -->
        <device Dname="STM32L475QG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L475QGIx"> <feature type="BGA" n="132"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L475ZG'  ***************************** -->
        <device Dname="STM32L475ZG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L475ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L476'  **************************** -->
      <subFamily DsubFamily="STM32L476">
        <debug svd="SVD/STM32L4x6.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L476xx"/>

        <book name="Documents/DM00083560.pdf" title="STM32L4x6 Reference Manual"/>
        <book name="Documents/DM00108832.pdf" title="STM32L476xx Data Sheet"/>

        <feature type="Timer"    n="14"   m="16"/>
        <feature type="Timer"    n="2"    m="32"/>
        <feature type="ADC"      n="3"    m="12"/>
        <feature type="DAC"      n="2"    m="12"/>
        <feature type="SPI"      n="3"/>
        <feature type="ComOther" n="2"                  name="SAI Interface"/>
        <feature type="I2C"      n="3"/>
        <feature type="USART"    n="6"    m="11250000"/>
        <feature type="USBOTG"   n="1"/>
        <feature type="CAN"      n="1"/>
        <feature type="VCC"      n="1.80" m="3.60"/>

        <!-- *************************  Device 'STM32L476RC'  ***************************** -->
        <device Dname="STM32L476RC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00018000" init="0"    default="1"/>
          <memory id="IRAM2"                         start="0x10000000" size="0x00008000" init="0"    default="0"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

