taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
          <variant Dvariant="STM32L486ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L451'  **************************** -->
      <subFamily DsubFamily="STM32L451">
        <debug svd="SVD/STM32L4x1_v1r1.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L451xx"/>

        <!-- *************************  Device 'STM32L451RE'  ***************************** -->
        <device Dname="STM32L451RE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L451RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L451REYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L451REIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L451RC'  ***************************** -->
        <device Dname="STM32L451RC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L451RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L451RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L451RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L451CC'  ***************************** -->
        <device Dname="STM32L451CC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L451CCUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L451CE'  ***************************** -->
        <device Dname="STM32L451CE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L451CEUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L451VC'  ***************************** -->
        <device Dname="STM32L451VC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L451VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L451VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L451VE'  ***************************** -->
        <device Dname="STM32L451VE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L451VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L451VEIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L452'  **************************** -->
      <subFamily DsubFamily="STM32L452">
        <debug svd="SVD/STM32L4x2_v1r1.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L452xx"/>

        <book name="Documents/DM00151935.pdf" title="STM32L4x2 Reference Manual"/>

        <!-- *************************  Device 'STM32L452RE'  ***************************** -->
        <device Dname="STM32L452RE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L452RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L452REYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L452REIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L452RC'  ***************************** -->
        <device Dname="STM32L452RC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L452RCTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L452RCYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L452RCIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L452CC'  ***************************** -->
        <device Dname="STM32L452CC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L452CCUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L452CE'  ***************************** -->
        <device Dname="STM32L452CE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

