taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
          <variant Dvariant="STM32L452CEUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L452VC'  ***************************** -->
        <device Dname="STM32L452VC">
          <memory id="IROM1"                         start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_256.FLM"  start="0x08000000" size="0x00040000"             default="1"/>

          <variant Dvariant="STM32L452VCTx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L452VCIx"> <feature type="BGA" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L452VE'  ***************************** -->
        <device Dname="STM32L452VE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L452VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L452VEIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L462'  **************************** -->
      <subFamily DsubFamily="STM32L462">
        <debug svd="SVD/STM32L4x2_v1r1.svd"/>
        <compile header="Device/Include/stm32l4xx.h"  define="STM32L462xx"/>

        <book name="Documents/DM00151935.pdf" title="STM32L4x2 Reference Manual"/>

        <!-- *************************  Device 'STM32L462RE'  ***************************** -->
        <device Dname="STM32L462RE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L462RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32L462REYx"> <feature type="CSP" n="64"/> </variant>
          <variant Dvariant="STM32L462REIx"> <feature type="BGA" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L462CE'  ***************************** -->
        <device Dname="STM32L462CE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L462CEUx"> <feature type="QFN" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L462VE'  ***************************** -->
        <device Dname="STM32L462VE">
          <memory id="IROM1"                         start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00028000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_512.FLM"  start="0x08000000" size="0x00080000"             default="1"/>

          <variant Dvariant="STM32L462VETx"> <feature type="QFP" n="100"/> </variant>
          <variant Dvariant="STM32L462VEIx"> <feature type="BGA" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4A6'  **************************** -->
      <subFamily DsubFamily="STM32L4A6">
        <debug svd="SVD/STM32L4x6_v1r1.svd"/>
        <compile define="STM32L4A6xx" header="Device/Include/stm32l4xx.h"/>

        <!-- *************************  Device 'STM32L4A6RG'  ***************************** -->
        <device Dname="STM32L4A6RG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6RGTx"><feature n="64" type="QFP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6VG'  ***************************** -->
        <device Dname="STM32L4A6VG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6VGTx"><feature n="100" type="QFP"/></variant>
          <variant Dvariant="STM32L4A6VGYx"><feature n="100" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6QG'  ***************************** -->
        <device Dname="STM32L4A6QG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6QGIx"><feature n="132" type="BGA"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6ZG'  ***************************** -->
        <device Dname="STM32L4A6ZG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6ZGTx"><feature n="144" type="QFP"/></variant>
          <variant Dvariant="STM32L4A6ZGYx"><feature n="144" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6AG'  ***************************** -->
        <device Dname="STM32L4A6AG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6AGIx"><feature n="169" type="BGA"/></variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L496'  **************************** -->
      <subFamily DsubFamily="STM32L496">
        <debug svd="SVD/STM32L4x6_v1r1.svd"/>
        <compile define="STM32L496xx" header="Device/Include/stm32l4xx.h"/>

        <!-- *************************  Device 'STM32L496RG'  ***************************** -->
        <device Dname="STM32L496RG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496RGTx"><feature n="64" type="QFP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496VG'  ***************************** -->
        <device Dname="STM32L496VG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496VGTx"><feature n="100" type="QFP"/></variant>
          <variant Dvariant="STM32L496VGYx"><feature n="100" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496QG'  ***************************** -->
        <device Dname="STM32L496QG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496QGIx"><feature n="132" type="BGA"/></variant>
        </device>

