taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L496ZG'  ***************************** -->
        <device Dname="STM32L496ZG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496ZGTx"><feature n="144" type="QFP"/></variant>
          <variant Dvariant="STM32L496ZGYx"><feature n="144" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L496AG'  ***************************** -->
        <device Dname="STM32L496AG">
          <memory id="IROM1"                         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00050000" init="0"    default="1"/>
          <algorithm name="Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L496AGIx"><feature n="169" type="BGA"/></variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L431">
      <description>STMicroelectronics STM32L431 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L431*"/>
    </condition>
    <condition id="STM32L432">
      <description>STMicroelectronics STM32L432 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L432*"/>
    </condition>
    <condition id="STM32L433">
      <description>STMicroelectronics STM32L433 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L433*"/>
    </condition>
    <condition id="STM32L443">
      <description>STMicroelectronics STM32L443 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L443*"/>
    </condition>
    <condition id="STM32L471">
      <description>STMicroelectronics STM32L471 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L471*"/>
    </condition>
    <condition id="STM32L475">
      <description>STMicroelectronics STM32L475 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L475*"/>
    </condition>
    <condition id="STM32L476">
      <description>STMicroelectronics STM32L476 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L476*"/>
    </condition>
    <condition id="STM32L485">
      <description>STMicroelectronics STM32L485 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L485*"/>
    </condition>
    <condition id="STM32L486">
      <description>STMicroelectronics STM32L486 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L486*"/>
    </condition>
    <condition id="STM32L451">
      <description>STMicroelectronics STM32L451 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L451*"/>
    </condition>
    <condition id="STM32L452">
      <description>STMicroelectronics STM32L452 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L452*"/>
    </condition>
    <condition id="STM32L462">
      <description>STMicroelectronics STM32L462 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L462*"/>
    </condition>
    <condition id="STM32L4A6">
      <description>STMicroelectronics STM32L4A6 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L4A6*"/>
    </condition>
    <condition id="STM32L496">
      <description>STMicroelectronics STM32L496 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L496*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L431 CMSIS">
      <description>STMicroelectronics STM32L431 Devices and CMSIS-Core</description>
      <require condition="STM32L431"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L432 CMSIS">
      <description>STMicroelectronics STM32L432 Devices and CMSIS-Core</description>
      <require condition="STM32L432"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L433 CMSIS">
      <description>STMicroelectronics STM32L433 Devices and CMSIS-Core</description>
      <require condition="STM32L433"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L443 CMSIS">
      <description>STMicroelectronics STM32L443 Devices and CMSIS-Core</description>
      <require condition="STM32L443"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L471 CMSIS">
      <description>STMicroelectronics STM32L471 Devices and CMSIS-Core</description>
      <require condition="STM32L471"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L475 CMSIS">
      <description>STMicroelectronics STM32L475 Devices and CMSIS-Core</description>
      <require condition="STM32L475"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L476 CMSIS">
      <description>STMicroelectronics STM32L476 Devices and CMSIS-Core</description>
      <require condition="STM32L476"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L485 CMSIS">
      <description>STMicroelectronics STM32L485 Devices and CMSIS-Core</description>
      <require condition="STM32L485"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
