taboadaa/ShuQi/nRF/Packages/.cache/Keil.STM32L4xx_DFP.1.4.0.pdsc
    <condition id="STM32L486 CMSIS">
      <description>STMicroelectronics STM32L486 Devices and CMSIS-Core</description>
      <require condition="STM32L486"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L451 CMSIS">
      <description>STMicroelectronics STM32L451 Devices and CMSIS-Core</description>
      <require condition="STM32L451"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L452 CMSIS">
      <description>STMicroelectronics STM32L452 Devices and CMSIS-Core</description>
      <require condition="STM32L452"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L462 CMSIS">
      <description>STMicroelectronics STM32L462 Devices and CMSIS-Core</description>
      <require condition="STM32L462"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L4A6 CMSIS">
      <description>STMicroelectronics STM32L4A6 Devices and CMSIS-Core</description>
      <require condition="STM32L4A6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L496 CMSIS">
      <description>STMicroelectronics STM32L496 Devices and CMSIS-Core</description>
      <require condition="STM32L496"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- Startup startup_stm32l431 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L431 CMSIS">
      <description>System Startup for STMicroelectronics STM32L431 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l431xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l432 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L432 CMSIS">
      <description>System Startup for STMicroelectronics STM32L432 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l432xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l433 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L433 CMSIS">
      <description>System Startup for STMicroelectronics STM32L433 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l433xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l443 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L443 CMSIS">
      <description>System Startup for STMicroelectronics STM32L443 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l443xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l471 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L471 CMSIS">
      <description>System Startup for STMicroelectronics STM32L471 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l471xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l475 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L475 CMSIS">
      <description>System Startup for STMicroelectronics STM32L475 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l475xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l476 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L476 CMSIS">
      <description>System Startup for STMicroelectronics STM32L476 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l476xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l485 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L485 CMSIS">
      <description>System Startup for STMicroelectronics STM32L485 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l485xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l486 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L486 CMSIS">
      <description>System Startup for STMicroelectronics STM32L486 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l486xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l451 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L451 CMSIS">
      <description>System Startup for STMicroelectronics STM32L451 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l451xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l452 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L452 CMSIS">
      <description>System Startup for STMicroelectronics STM32L452 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l452xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l462 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="STM32L462 CMSIS">
      <description>System Startup for STMicroelectronics STM32L462 Devices</description>
      <files>
        <file category="include"   name="Device/Include/"/>
        <file category="sourceAsm" name="Device/Source/ARM/startup_stm32l462xx.s" attr="config" version="1.2.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device/Source/system_stm32l4xx.c"        attr="config" version="1.2.0"/>
      </files>
    </component>

